In [12]:
#https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf
import pandas as pd

In [2]:
df = pd.DataFrame(
{"a":[4,5,6],
 "b":[7,8,9],
 "c":[10,11,12]},
index = [1,2,3])

In [3]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [4]:
df["a"]

1    4
2    5
3    6
Name: a, dtype: int64

In [5]:
df[["a","b"]]

   a  b
1  4  7
2  5  8
3  6  9

In [6]:
df.loc[3]

a     6
b     9
c    12
Name: 3, dtype: int64

In [7]:
df.loc[3,"c"]

12

In [8]:
df.loc[[1,3], "a"]

1    4
3    6
Name: a, dtype: int64

In [9]:
df.loc[[1,3],["b","c"]]

   b   c
1  7  10
3  9  12

In [10]:
df = pd.DataFrame(
    [[4,7,10],
    [5,8,11],
    [6,9,12]],
    index=[1,2,3],
    columns=['a','b','c'])

In [11]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [13]:
df = pd.DataFrame(
    {"a" : [4 ,5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d',1),('d',2),('e',2)],
    names=['n','v']))

In [14]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [15]:
df[df.a > 7]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [16]:
df[df.a < 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [17]:
df[df.a < 5]

     a  b   c
n v
d 1  4  7  10

In [18]:
df[df["a"] < 5]

     a  b   c
n v
d 1  4  7  10

In [26]:
df = pd.DataFrame(
    {"a" : [4 ,5, 6, 6],
    "b" : [7, 8, 9, 9],
    "c" : [10, 11, 12, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d',1),('d',2),('e',2),('e',3)],
    names=['n','v']))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [27]:
df.drop_duplicates?

In [24]:
df = df.drop_duplicates()

In [25]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12